---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarWorkInstructions
source: html/b7a51829-c964-ed2b-6830-d1326d1a6297.htm
---
# Autodesk.Revit.DB.Structure.RebarWorkInstructions

Describes how a Free Form Rebar will be fabricated.

## Syntax (C#)
```csharp
public enum RebarWorkInstructions
```